In [2]:
#imports

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
import os

In [2]:
import warnings
warnings.filterwarnings("ignore")

In [3]:
# creating a directory for plots if it doesn't exist

if not os.path.isdir('Plots'):
    os.mkdir("Plots")

In [24]:
#Read the selected dataset
df = pd.read_csv('NBA Salaries(1990-2023).csv')

# list the fields/variables
display(df.head())
# identifing their types
display(df.dtypes)

print("     ")
print("Data Preparation 'b':")

print("     ")
print('Outliers:')
print("     ")

Q1 = df['salary'].quantile(0.25)
Q3 = df['salary'].quantile(0.75)
IQR = Q3 - Q1
display(IQR)
# Identify outliers
outliers = df[(df['salary'] < Q1 - 1.5 * IQR) | (df['salary'] > Q3 + 1.5 * IQR)]
# List the outliers
print("Outliers in 'salary':")
print(outliers[['playerName', 'salary']])

# Remove outliers from 'salary' column
df = df[~((df['salary'] < Q1 - 1.5 * IQR) | (df['salary'] > Q3 + 1.5 * IQR))]


Q1 = df['inflationAdjSalary'].quantile(0.25)
Q3 = df['inflationAdjSalary'].quantile(0.75)
IQR = Q3 - Q1
display(IQR)
# Identify outliers
outliers = df[(df['inflationAdjSalary'] < Q1 - 1.5 * IQR) | (df['inflationAdjSalary'] > Q3 + 1.5 * IQR)]
# List the outliers
print("Outliers in 'inflationAdjSalary':")
print(outliers[['playerName', 'inflationAdjSalary']])

# Remove outliers from 'inflationAdjSalary' column
print("  After Fixing the Outliers:   ")
df = df[~((df['inflationAdjSalary'] < Q1 - 1.5 * IQR) | (df['inflationAdjSalary'] > Q3 + 1.5 * IQR))]
display(df.head())

print("     ")
print('Missing data:')
print("     ")

# List Missing data before the Imputing:
columns_with_missing_data = df.columns[df.isnull().any()]
print("Columns with missing data:")
print(columns_with_missing_data)
# Imputing the inconsistencies :
df['salary'] = df['salary'].fillna(df['salary'].mean()).astype(int)
df['inflationAdjSalary'] = df['inflationAdjSalary'].fillna(df['inflationAdjSalary'].mean()).astype(int)
print("  After Fixing the Missing Data:   ")
display(df.head())

# Save the cleaned DataFrame to a new CSV file
df.to_csv('cleaned_data.csv', index=False)

   Unnamed: 0        playerName  seasonStartYear   salary  inflationAdjSalary
0           0     Patrick Ewing             1990  4250000             9694547
1           1  Hot Rod Williams             1990  3785000             8633850
2           2   Hakeem Olajuwon             1990  3175000             7242397
3           3   Charles Barkley             1990  2900000             6615103
4           4      Chris Mullin             1990  2850000             6501049

Unnamed: 0             int64
playerName            object
seasonStartYear        int64
salary                 int64
inflationAdjSalary     int64
dtype: object

Data Preparation 'b':

Outliers:

4038880.0

Outliers in 'salary':
            playerName    salary
1521     Magic Johnson  14660000
1939     Patrick Ewing  18724000
2390    Michael Jordan  30140000
2391      Horace Grant  14857000
2392     Reggie Miller  11250000
...                ...       ...
15317  Josh Richardson  11615328
15318    Marvin Bagley  11312114
15319   DeAndre Jordan  11109327
15320    Dwight Powell  11080125
15321   Devonte Graham  11000000

[1582 rows x 2 columns]

4079400.0

Outliers in 'inflationAdjSalary':
            playerName  inflationAdjSalary
352         Larry Bird            15403814
735     David Robinson            12089150
1136    David Robinson            11778567
1522    David Robinson            14615339
1523      James Worthy            14515234
...                ...                 ...
15322  Zion Williamson            11705820
15323   Larry Nance Jr            11659479
15324      Jeremy Lamb            11451274
15325   Reggie Jackson            11325310
15326   Richaun Holmes            11325310

[649 rows x 2 columns]
  After Fixing the Outliers:

   Unnamed: 0        playerName  seasonStartYear   salary  inflationAdjSalary
0           0     Patrick Ewing             1990  4250000             9694547
1           1  Hot Rod Williams             1990  3785000             8633850
2           2   Hakeem Olajuwon             1990  3175000             7242397
3           3   Charles Barkley             1990  2900000             6615103
4           4      Chris Mullin             1990  2850000             6501049

Missing data:

Columns with missing data:
Index([], dtype='object')
  After Fixing the Missing Data:

   Unnamed: 0        playerName  seasonStartYear   salary  inflationAdjSalary
0           0     Patrick Ewing             1990  4250000             9694547
1           1  Hot Rod Williams             1990  3785000             8633850
2           2   Hakeem Olajuwon             1990  3175000             7242397
3           3   Charles Barkley             1990  2900000             6615103
4           4      Chris Mullin             1990  2850000             6501049

In [5]:
 df=pd.read_csv("cleaned_data.csv")

# the statistical summaries
display(df.describe(include='number'))
display(df.describe(include='object'))

       seasonStartYear        salary  inflationAdjSalary
count     13626.000000  1.362600e+04        1.362600e+04
mean       2006.467489  2.195168e+06        3.175440e+06
std           9.615958  2.040533e+06        2.756306e+06
min        1990.000000  2.706000e+03        4.824000e+03
25%        1998.000000  6.750000e+05        1.049911e+06
50%        2007.000000  1.517981e+06        2.254333e+06
75%        2015.000000  3.120810e+06        4.663255e+06
max        2021.000000  1.033562e+07        1.129111e+07

           playerName
count           13626
unique           2811
top     Udonis Haslem
freq               20